"""
Задание 5 (Необязательное)
Напишите код для преобразования произвольного списка вида ['2018-01-01', 'yandex',
'cpc', 100] (он может быть любой длины) в словарь {'2018-01-01': {'yandex': {'cpc': 100}}}

"""

lst = ['2018-01-01', 'yandex', 'cpc', 100]

dict_lst = {lst[-2]: lst[-1]}

for key in lst[::-1][2:]:
    dict_lst = {key: dict_lst}
print(dict_lst)
