d = {'A': 1, 'B': 2, 'C': 3, 'D': 4, 'E': 0, 'F': -5}
# через lambda
print('через lambda:')
k_max = max(d, key=(lambda k: d[k]))
k_min = min(d, key=(lambda k: d[k]))

print(f'{k_max} = {d[k_max]}')
print(f'{k_min} = {d[k_min]}')


# через метод словаря get
print('через метод словаря get')
k_max = max(d, key=d.get)
k_min = min(d, key=d.get)

print(f'{k_max} = {d[k_max]}')
print(f'{k_min} = {d[k_min]}')

# Вложенный словарь
students = {
'Трамп':{'Геометрия': 2,'Биология': 3,'Английский язык': 5,'Физика': 3,'Алгебра': 2,'Украинский язык': 2,'Химия': 3,'Право': 5,'история': 1,'Нимецький язык': 2},
'Путин':{'Геометрия': 3,'Биология': 3,'Английский язык': 5,'Физика': 3,'Алгебра': 2,'Украинский язык': 2,'Химия': 3,'Право': 5,'история': 1,'Нимецький язык': 2},
'Шойгу':{'Геометрия': 4,'Биология': 4,'Английский язык': 4,'Физика': 4,'Алгебра': 1,'Украинский язык': 3,'Химия': 1,'Право': 2,'история': 1,'Нимецький язык': 5},
'Медведев':{'Геометрия': 2,'Биология': 1,'Английский язык': 2,'Физика': 1,'Алгебра': 2,'Украинский язык': 2,'Химия': 1,'Право': 2,'история': 1,'Нимецький язык': 1},
'Байден':{'Геометрия': 2,'Биология':2,'Английский язык': 5,'Физика': 3,'Алгебра': 2,'Украинский язык': 2,'Химия': 3,'Право': 1,'история': 3,'Нимецький язык': 3},
'Пригожин':{'Геометрия': 3,'Биология': 4,'Английский язык': 5,'Физика': 1,'Алгебра': 2,'Украинский язык': 1,'Химия': 3,'Право': 5,'история': 1,'Нимецький язык': 2},
'Валька стакан':{'Геометрия': 4,'Биология': 5,'Английский язык': 5,'Физика': 4,'Алгебра': 2,'Украинский язык': 2,'Химия': 3,'Право': 1,'история': 4,'Нимецький язык': 4},
'Володин':{'Геометрия': 4,'Биология': 3,'Английский язык': 5,'Физика': 5,'Алгебра': 2,'Украинский язык': 1,'Химия': 3,'Право': 5,'история': 1,'Нимецький язык': 4},
'Хорохордин':{'Геометрия': 1,'Биология': 3,'Английский язык': 5,'Физика': 3,'Алгебра': 3,'Украинский язык': 5,'Химия': 2,'Право': 3,'история': 4,'Нимецький язык': 2},
'Зюганов':{'Геометрия': 5,'Биология': 5,'Английский язык': 5,'Физика': 5,'Алгебра': 5,'Украинский язык': 5,'Химия': 4,'Право': 4,'история': 5,'Нимецький язык': 5}
            }

students_max = max(students, key=lambda x: sum(students[x].values()))
students_min = min(students, key=lambda x: sum(students[x].values()))

print(students_min, students_max)

