INSERT INTO stepik.fine (fine_id, name, number_plate, violation, sum_fine, date_violation, date_payment)
VALUES  (1, 'Баранов П.Е.', 'P523BT', 'Превышение скорости(от 40 до 60)', 2000.00, '2020-02-14', '2020-03-06'),
        (2, 'Абрамова К.А.', 'О111AB', 'Проезд на запрещающий сигнал', 2000.00, '2020-02-23', NULL),
        (3, 'Яковлев Г.Р.', 'T330TT', 'Проезд на запрещающий сигнал', 500.00, '2020-03-03', '2020-03-23'),
        (4, 'Баранов П.Е.', 'P523BT', 'Превышение скорости(от 40 до 60)', 500.00, '2020-01-12', '2020-01-17'),
        (5, 'Абрамова К.А.', 'О111AB', 'Проезд на запрещающий сигнал', 1000.00, '2020-01-14', '2020-02-27'),
        (6, 'Яковлев Г.Р.', 'T330TT', 'Превышение скорости(от 20 до 40)', 500.00, '2020-01-23', '2020-02-23'),
        (7, 'Яковлев Г.Р.', 'M701AA', 'Превышение скорости(от 20 до 40)', 250.00, '2020-01-12', '2020-01-22'),
        (8, 'Колесов С.П.', 'K892AX', 'Превышение скорости(от 20 до 40)', 500.00, '2020-02-01', NULL);