INSERT INTO stepik.fine (name,number_plate,violation,sum_fine,date_violation,date_payment) VALUES
	 ('Баранов П.Е.','P523BT','Превышение скорости(от 40 до 60)',2000.00,'2020-02-14',NULL),
	 ('Абрамова К.А.','О111AB','Проезд на запрещающий сигнал',2000.00,'2020-02-23',NULL),
	 ('Яковлев Г.Р.','T330TT','Проезд на запрещающий сигнал',1000.00,'2020-03-03',NULL),
	 ('Баранов П.Е.','P523BT','Превышение скорости(от 40 до 60)',500.00,'2020-01-12','2020-01-17'),
	 ('Абрамова К.А.','О111AB','Проезд на запрещающий сигнал',1000.00,'2020-01-14','2020-02-27'),
	 ('Яковлев Г.Р.','T330TT','Превышение скорости(от 20 до 40)',500.00,'2020-01-23','2020-02-23'),
	 ('Яковлев Г.Р.','M701AA','Превышение скорости(от 20 до 40)',500.00,'2020-01-12',NULL),
	 ('Колесов С.П.','K892AX','Превышение скорости(от 20 до 40)',500.00,'2020-02-01',NULL);
