"""
Дополните приведенный ниже код, чтобы переменная regex содержала регулярное выражение,
которому соответствуют даты следующих форматов:
    DD.MM.YYYY
    DD/MM/YYYY
    YYYY.MM.DD
    YYYY/MM/DD

Sample Input 1:
-- Exam days -- Math: 24.03.2022 Chemistry: 24/03/2022 Physics: 2022.03.25 France: 2022/03/29

Sample Output 1:
24.03.2022 24/03/2022 2022.03.25 2022/03/29

Sample Input 2:
first date: 01.12.22, second date: 01/12/22, thirs date 09.07.2003 07/09/2003

Sample Output 2:
09.07.2003 07/09/2003

# TEST_3:
i was born 01.12/2001 or 01/12.2001 and 01.12.1999
# 01.12.1999

# TEST_4:
1a.20.2012 12.2b.2011 25.10.2c90 01/01/2001
# 01/01/2001

# TEST_5:
200.01.01 2001.121.12 2001/12/12
# 2001/12/12

# TEST_6:
1982/13.08 1982.08/13 1982.3a.a9
#

# TEST_7:
2001/12/3 2001/03/12 3/12/2001 2001.3.12 3.12.2001
# 2001/03/12
"""

import re

regex = r'\d{2}\.\d{2}\.\d{4}|' \
        r'\d{2}\/\d{2}\/\d{4}|' \
        r'\d{4}\.\d{2}\.\d{2}|' \
        r'\d{4}\/\d{2}\/\d{2}'

print(*re.findall(regex, input()))
