"""
Коллекции

Напишите программу, которая принимает на вход корректный непустой список, корректный непустой кортеж или корректное
произвольной длины множество, и выполняет следующее:

    если введен список, выводит его последний элемент
    если введен кортеж, выводит его первый элемент
    если введено множество, выводит количество его элементов

Формат входных данных
На вход программе подается корректный непустой список, кортеж или корректное произвольной длины множество.

Формат выходных данных
Программа должна вывести определенное значение, в зависимости от типа введенной коллекции.

Sample Input 1:
[[1, 2], [3, 4], [5, 6]]

Sample Output 1:
[5, 6]

Sample Input 2:
{'Arthur', 'Timur', 'Anri', 'Ruslan', 'Dima'}

Sample Output 2:
5

Sample Input 3:
('black', 'blue', 'red', 'orange', 'green', 'gray')

Sample Output 3:
black
"""

n = eval(input())
print(eval({list: 'n[-1]', tuple: 'n[0]', set: 'len(n)'}[type(n)]))

# input_any_type = eval(input())
# match input_any_type:
#     case list():
#         print(input_any_type[-1])
#     case tuple():
#         print(input_any_type[0])
#     case set():
#         print(len(input_any_type))
