"""
FAKE NEWS 🌶️

Команда BEEGEEK планирует выпустить свой новый курс 08.11.2022 ровно в 12:00. Напишите программу, которая принимает
на вход текущие дату и время и определяет, сколько времени осталось до выхода курса.

Формат входных данных
На вход программе подаются текущие дата и время в формате DD.MM.YYYY HH:MM.

Формат выходных данных
Программа должна вывести текст с указанием количества дней и часов, оставшихся до выхода курса, в следующем формате:
До выхода курса осталось: <кол-во дней> дней и <кол-во часов> часов
Если в данном случае количество часов равно нулю, то вывести нужно только дни.
Если количество дней равно нулю, то вывести нужно только часы и минуты в следующем формате:
До выхода курса осталось: <кол-во часов> часов и <кол-во минут> минут
Если в данном случае количество минут равно нулю, то вывести нужно только часы. Аналогично, если количество часов
равно нулю, то вывести нужно только минуты.
Если введенные дата и время больше либо равны 08.11.2022 12:00, программа должна вывести текст:
Курс уже вышел!

Примечание 1.
Программа должна подбирать правильную форму для существительных «день» и «минута».
Для этого можете смело взять свою функцию choose_plural() из этой задачи.

Sample Input 1:
16.11.2021 06:30

Sample Output 1:
До выхода курса осталось: 357 дней и 5 часов

Sample Input 2:
6.11.2022 12:00

Sample Output 2:
До выхода курса осталось: 2 дня

Sample Input 3:
08.11.2022 10:30

Sample Output 3:
До выхода курса осталось: 1 час и 30 минут

Sample Input 4:
08.11.2022 09:00

Sample Output 4:
До выхода курса осталось: 3 часа

Sample Input 5:
08.11.2022 11:40

Sample Output 5:
До выхода курса осталось: 20 минут

Sample Input 6:
08.11.2022 12:15

Sample Output 6:
Курс уже вышел!


"""
from datetime import datetime


def chpl(n, k=0):
    units = {0: ('день', 'дня', 'дней'), 1: ('час', 'часа', 'часов'), 2: ('минута', 'минуты', 'минут')}
    d = units[k]
    s = {1: d[0], 2: d[1], 3: d[1], 4: d[1], 5: d[2], 6: d[2], 7: d[2], 8: d[2], 9: d[2], 0: d[2]}

    return f'{n} {(s[n % 10], d[2])[10 < n % 100 < 20]}'


t_end = datetime(year=2022, month=11, day=8, hour=12)
t_now = datetime.strptime(input(), '%d.%m.%Y %H:%M')

if t_now >= t_end:
    print('Курс уже вышел!')
else:
    delta = t_end - t_now
    days, sec = delta.days, delta.seconds
    h, m, st_out = sec // 3600, sec % 3600 // 60, ''
    if days != 0 and h != 0:
        st_out = f'{chpl(days)} и {chpl(h, 1)}'
    elif days != 0 and h == 0:
        st_out = f'{chpl(days)}'
    elif days == 0 and h != 0 and m != 0:
        st_out = f'{chpl(h, 1)} и {chpl(m, 2)}'
    elif days == 0 and h != 0 and m == 0:
        st_out = f'{chpl(h, 1)}'
    elif days == 0 and h == 0 and m != 0:
        st_out = f'{chpl(m, 2)}'
    print(f'До выхода курса осталось: {st_out}')
