"""
Коля написал веселую игру для младшей сестры: он просит Алёнку придумать историю по кошку, а программа заменяет
каждое слово 'кошка' (в разных падежах) на имя 'Алёнка'. Написание слова 'кошка' в тексте только строчными буквами.
Пример
Ввод
У меня живет кошка, кошка милая, игривая и очень пушистая. Мы забрали кошку из приюта, когда кошке было 3 месяца.
Любимая игра кошки - запрыгивать на шкаф.

Вывод
У меня живет Алёнка, Алёнка милая, игривая и очень пушистая. Мы забрали Алёнку из приюта, когда Алёнке было 3
месяца. Любимая игра Алёнки - запрыгивать на шкаф.

"""
print(input().replace('кошк', 'Алёнк'))




